# Dataframe - Heart Of Pandas
* Data Structure in Pandas
* Helps in data analysis & cleaning

In [1]:
import pandas as pd

In [51]:
Info11 = pd.Series({'Name': 'Veena',
                        'Fav_Actor': 'Lee Joon Gi',
                        'Fav_Number': 9})
Info22 = pd.Series({'Name': 'Sreya',
                        'Fav_Actor': 'Lee Min Ho',
                        'Fav_Number': 7})
Info33 = pd.Series({'Name': 'Haripriya',
                        'Fav_Actor': 'Lee Jong Suk',
                        'Fav_Number': 3})
df = pd.DataFrame([Info11, Info22, Info33], index=['Info1', 'Info2', 'Info3'])
df.head()

            Name     Fav_Actor  Fav_Number
Info1      Veena   Lee Joon Gi           9
Info2      Sreya    Lee Min Ho           7
Info3  Haripriya  Lee Jong Suk           3

In [52]:
df['Name']  #column

Info1        Veena
Info2        Sreya
Info3    Haripriya
Name: Name, dtype: object

In [50]:
df.loc['Info3']  #row

Name             Haripriya
Fav_Actor     Lee Jong Suk
Fav_Number               3
Name: Info3, dtype: object

In [5]:
type(df.loc['Info3'])

pandas.core.series.Series

In [9]:
df.T

                  Info1       Info2         Info3
Name              Veena       Sreya     Haripriya
Fav_Actor   Lee Joon Gi  Lee Min Ho  Lee Jong Suk
Fav_Number            9           7             3

In [13]:
df.loc['Info1']['Fav_Number']

9

In [14]:
df.loc[:,['Name','Fav_Number']]

            Name  Fav_Number
Info1      Veena           9
Info2      Sreya           7
Info3  Haripriya           3

In [18]:
copy_df = df.copy()
copy_df = copy_df.drop('Info3')   #row deletion
copy_df

        Name    Fav_Actor  Fav_Number
Info1  Veena  Lee Joon Gi           9
Info2  Sreya   Lee Min Ho           7

In [17]:
copy_df.drop?

In [21]:
del copy_df['Name']  #column deletion
copy_df

         Fav_Actor  Fav_Number
Info1  Lee Joon Gi           9
Info2   Lee Min Ho           7

In [54]:
df['Fav_Series']=None   #adding new column
df

            Name     Fav_Actor  Fav_Number Fav_Series
Info1      Veena   Lee Joon Gi           9       None
Info2      Sreya    Lee Min Ho           7       None
Info3  Haripriya  Lee Jong Suk           3       None

In [46]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df1 = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df1['Cost'] *= 0.8
df1

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  18.0
Store 1  Kevyn   Kitty Litter   2.0
Store 2  Vinod      Bird Seed   4.0

In [40]:
Costs=df1['Cost']
Costs

Store 1    18.0
Store 1     2.0
Store 2     4.0
Name: Cost, dtype: float64

In [41]:
Costs+=2
Costs

Store 1    20.0
Store 1     4.0
Store 2     6.0
Name: Cost, dtype: float64

In [42]:
df1

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  20.0
Store 1  Kevyn   Kitty Litter   4.0
Store 2  Vinod      Bird Seed   6.0

In [37]:
Costs * 2
Costs

Store 1    20.0
Store 1     4.0
Store 2     6.0
Name: Cost, dtype: float64

In [43]:
df1

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  20.0
Store 1  Kevyn   Kitty Litter   4.0
Store 2  Vinod      Bird Seed   6.0

In [57]:
df

            Name     Fav_Actor  Fav_Number Fav_Series
Info1      Veena   Lee Joon Gi           9       None
Info2      Sreya    Lee Min Ho           7       None
Info3  Haripriya  Lee Jong Suk           3       None

In [3]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [4]:
df = df.set_index([df.index, 'Name'])
df.index.names = ['Location', 'Name']
df = df.append(pd.Series(data={'Cost': 3.00, 'Item Purchased': 'Kitty Food'}, name=('Store 2', 'Kevyn')))
df

               Item Purchased  Cost
Location Name
Store 1  Chris       Dog Food  22.5
         Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0
         Kevyn     Kitty Food   3.0